7767517
182 202
Input            input                    0 1 input
Convolution      463                      1 1 input 463 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
ReLU             465                      1 1 463 465
Convolution      466                      1 1 465 466 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             468                      1 1 466 468
ConvolutionDepthWise 469                      1 1 468 469 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             471                      1 1 469 471
Convolution      472                      1 1 471 472 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      474                      1 1 472 474 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
ReLU             476                      1 1 474 476
ConvolutionDepthWise 477                      1 1 476 477 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             479                      1 1 477 479
Convolution      480                      1 1 479 480 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_0              1 2 480 480_splitncnn_0 480_splitncnn_1
Convolution      482                      1 1 480_splitncnn_1 482 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
ReLU             484                      1 1 482 484
ConvolutionDepthWise 485                      1 1 484 485 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
ReLU             487                      1 1 485 487
Convolution      488                      1 1 487 488 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         490                      2 1 488 480_splitncnn_0 490 0=0
Convolution      491                      1 1 490 491 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
ReLU             493                      1 1 491 493
ConvolutionDepthWise 494                      1 1 493 494 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
ReLU             496                      1 1 494 496
Convolution      497                      1 1 496 497 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_1              1 2 497 497_splitncnn_0 497_splitncnn_1
Convolution      499                      1 1 497_splitncnn_1 499 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
ReLU             501                      1 1 499 501
ConvolutionDepthWise 502                      1 1 501 502 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
ReLU             504                      1 1 502 504
Convolution      505                      1 1 504 505 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         507                      2 1 505 497_splitncnn_0 507 0=0
Split            splitncnn_2              1 2 507 507_splitncnn_0 507_splitncnn_1
Convolution      508                      1 1 507_splitncnn_1 508 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
ReLU             510                      1 1 508 510
ConvolutionDepthWise 511                      1 1 510 511 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
ReLU             513                      1 1 511 513
Convolution      514                      1 1 513 514 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         516                      2 1 514 507_splitncnn_0 516 0=0
Convolution      517                      1 1 516 517 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
ReLU             519                      1 1 517 519
Split            splitncnn_3              1 2 519 519_splitncnn_0 519_splitncnn_1
ConvolutionDepthWise 520                      1 1 519_splitncnn_1 520 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
ReLU             522                      1 1 520 522
Convolution      523                      1 1 522 523 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_4              1 2 523 523_splitncnn_0 523_splitncnn_1
Convolution      525                      1 1 523_splitncnn_1 525 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
ReLU             527                      1 1 525 527
ConvolutionDepthWise 528                      1 1 527 528 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
ReLU             530                      1 1 528 530
Convolution      531                      1 1 530 531 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         533                      2 1 531 523_splitncnn_0 533 0=0
Split            splitncnn_5              1 2 533 533_splitncnn_0 533_splitncnn_1
Convolution      534                      1 1 533_splitncnn_1 534 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
ReLU             536                      1 1 534 536
ConvolutionDepthWise 537                      1 1 536 537 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
ReLU             539                      1 1 537 539
Convolution      540                      1 1 539 540 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         542                      2 1 540 533_splitncnn_0 542 0=0
Split            splitncnn_6              1 2 542 542_splitncnn_0 542_splitncnn_1
Convolution      543                      1 1 542_splitncnn_1 543 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
ReLU             545                      1 1 543 545
ConvolutionDepthWise 546                      1 1 545 546 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
ReLU             548                      1 1 546 548
Convolution      549                      1 1 548 549 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         551                      2 1 549 542_splitncnn_0 551 0=0
Convolution      552                      1 1 551 552 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
ReLU             554                      1 1 552 554
ConvolutionDepthWise 555                      1 1 554 555 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
ReLU             557                      1 1 555 557
Convolution      558                      1 1 557 558 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_7              1 2 558 558_splitncnn_0 558_splitncnn_1
Convolution      560                      1 1 558_splitncnn_1 560 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
ReLU             562                      1 1 560 562
ConvolutionDepthWise 563                      1 1 562 563 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
ReLU             565                      1 1 563 565
Convolution      566                      1 1 565 566 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         568                      2 1 566 558_splitncnn_0 568 0=0
Split            splitncnn_8              1 2 568 568_splitncnn_0 568_splitncnn_1
Convolution      569                      1 1 568_splitncnn_1 569 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
ReLU             571                      1 1 569 571
ConvolutionDepthWise 572                      1 1 571 572 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
ReLU             574                      1 1 572 574
Convolution      575                      1 1 574 575 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         577                      2 1 575 568_splitncnn_0 577 0=0
Convolution      578                      1 1 577 578 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
ReLU             580                      1 1 578 580
Split            splitncnn_9              1 2 580 580_splitncnn_0 580_splitncnn_1
ConvolutionDepthWise 581                      1 1 580_splitncnn_1 581 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
ReLU             583                      1 1 581 583
Convolution      584                      1 1 583 584 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=92160
Split            splitncnn_10             1 2 584 584_splitncnn_0 584_splitncnn_1
Convolution      586                      1 1 584_splitncnn_1 586 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
ReLU             588                      1 1 586 588
ConvolutionDepthWise 589                      1 1 588 589 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
ReLU             591                      1 1 589 591
Convolution      592                      1 1 591 592 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         594                      2 1 592 584_splitncnn_0 594 0=0
Split            splitncnn_11             1 2 594 594_splitncnn_0 594_splitncnn_1
Convolution      595                      1 1 594_splitncnn_1 595 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
ReLU             597                      1 1 595 597
ConvolutionDepthWise 598                      1 1 597 598 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
ReLU             600                      1 1 598 600
Convolution      601                      1 1 600 601 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         603                      2 1 601 594_splitncnn_0 603 0=0
Convolution      604                      1 1 603 604 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
ReLU             606                      1 1 604 606
ConvolutionDepthWise 607                      1 1 606 607 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
ReLU             609                      1 1 607 609
Convolution      610                      1 1 609 610 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=307200
Split            splitncnn_12             1 2 610 610_splitncnn_0 610_splitncnn_1
Convolution      612                      1 1 610_splitncnn_1 612 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=20480
ReLU             614                      1 1 612 614 0=1.000000e-01
Split            splitncnn_13             1 2 614 614_splitncnn_0 614_splitncnn_1
Convolution      615                      1 1 614_splitncnn_1 615 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
ReLU             617                      1 1 615 617 0=1.000000e-01
Concat           618                      1 1 614_splitncnn_0 618 0=0
Convolution      619                      1 1 618 619 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             621                      1 1 619 621 0=1.000000e-01
Split            splitncnn_14             1 2 621 621_splitncnn_0 621_splitncnn_1
Convolution      622                      1 1 621_splitncnn_1 622 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             624                      1 1 622 624 0=1.000000e-01
Convolution      625                      1 1 624 625 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             627                      1 1 625 627 0=1.000000e-01
Concat           628                      1 1 621_splitncnn_0 628 0=0
Convolution      629                      1 1 628 629 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             631                      1 1 629 631 0=1.000000e-01
Concat           632                      3 1 631 627 617 632 0=0
Convolution      633                      1 1 632 633 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Concat           635                      1 1 610_splitncnn_0 635 0=0
Interp           662                      1 1 635 662 0=1 1=2.000000e+00 2=2.000000e+00
Convolution      663                      1 1 662 663 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=20480
ReLU             665                      1 1 663 665 0=1.000000e-01
Concat           666                      1 1 580_splitncnn_0 666 0=0
Convolution      667                      1 1 666 667 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
ReLU             669                      1 1 667 669 0=1.000000e-01
BinaryOp         670                      2 1 669 665 670 0=0
Split            splitncnn_15             1 2 670 670_splitncnn_0 670_splitncnn_1
Convolution      671                      1 1 670_splitncnn_1 671 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             673                      1 1 671 673 0=1.000000e-01
Split            splitncnn_16             1 2 673 673_splitncnn_0 673_splitncnn_1
Convolution      674                      1 1 673_splitncnn_1 674 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
ReLU             676                      1 1 674 676 0=1.000000e-01
Concat           677                      1 1 673_splitncnn_0 677 0=0
Convolution      678                      1 1 677 678 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             680                      1 1 678 680 0=1.000000e-01
Split            splitncnn_17             1 2 680 680_splitncnn_0 680_splitncnn_1
Convolution      681                      1 1 680_splitncnn_1 681 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             683                      1 1 681 683 0=1.000000e-01
Convolution      684                      1 1 683 684 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             686                      1 1 684 686 0=1.000000e-01
Concat           687                      1 1 680_splitncnn_0 687 0=0
Convolution      688                      1 1 687 688 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             690                      1 1 688 690 0=1.000000e-01
Concat           691                      3 1 690 686 676 691 0=0
Convolution      692                      1 1 691 692 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Concat           694                      1 1 670_splitncnn_0 694 0=0
Interp           721                      1 1 694 721 0=1 1=2.000000e+00 2=2.000000e+00
Convolution      722                      1 1 721 722 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             724                      1 1 722 724 0=1.000000e-01
Concat           725                      1 1 519_splitncnn_0 725 0=0
Convolution      726                      1 1 725 726 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
ReLU             728                      1 1 726 728 0=1.000000e-01
BinaryOp         729                      2 1 728 724 729 0=0
Convolution      730                      1 1 729 730 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             732                      1 1 730 732 0=1.000000e-01
Split            splitncnn_18             1 2 732 732_splitncnn_0 732_splitncnn_1
Convolution      733                      1 1 732_splitncnn_1 733 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
ReLU             735                      1 1 733 735 0=1.000000e-01
Concat           736                      1 1 732_splitncnn_0 736 0=0
Convolution      737                      1 1 736 737 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             739                      1 1 737 739 0=1.000000e-01
Split            splitncnn_19             1 2 739 739_splitncnn_0 739_splitncnn_1
Convolution      740                      1 1 739_splitncnn_1 740 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             742                      1 1 740 742 0=1.000000e-01
Convolution      743                      1 1 742 743 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             745                      1 1 743 745 0=1.000000e-01
Concat           746                      1 1 739_splitncnn_0 746 0=0
Convolution      747                      1 1 746 747 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             749                      1 1 747 749 0=1.000000e-01
Concat           750                      3 1 749 745 735 750 0=0
Convolution      751                      1 1 750 751 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
